Revit 2022 API
AnalyticalModelStick.GetLocalCoordinateSystem Method
Overload List
Name | Description
GetLocalCoordinateSystem()
 Gets the local coordinate system (LCS) for an analytical model element.
 (Inherited from AnalyticalModel.)
GetLocalCoordinateSystem(Double)
 Gets the local coordinate system (LCS) that reflects analytical model orientation at the specified parameter value along a curve.
GetLocalCoordinateSystem(XYZ)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
See Also
AnalyticalModelStick Class
AnalyticalModelStick Members
Autodesk.Revit.DB.Structure Namespace